<template>
    <div class="container">
        <div class="gxst-title">Теорема синусов</div>
        <div><div>Теорему Пифагора и тригонометрические&nbsp;функции острого угла&nbsp;можно использовать для вычисления элементов только в прямоугольном треугольнике.</div><div>&nbsp;</div></div>
        <div align="left">Для нахождения элементов в произвольном треугольнике используется теорема синусов или теорема косинусов.</div>
        <div><div align="left"><img class="gxs-resource-image" alt="4cepure.JPG" src="//ykl-res.azureedge.net/6410637d-1743-4cc3-a02d-da4f44eaead6/4cepure.JPG"></div></div>
        <div class="gxst-theory">
            <div>
                Теорема синусов <br>

                Стороны треугольника пропорциональны синусам противолежащих углов: <br>

                a / sinA=b / sinB=c / sinC <br>
            </div>
        </div>
        <div>
            (в решении задачи одновременно пишутся две части, они образуют пропорцию). <br>
            <br>
            Теорема синусов используется для вычисления: <br>
            <br>
            неизвестных сторон треугольника, если даны два угла и одна сторона; <br>
            неизвестных углов треугольника, если даны две стороны и один прилежащий угол. <br>
            <br>
            Так как один из углов треугольника может быть тупым, значение синуса тупого угла находится по формуле приведения  sin(180°−α)=sinα .
            <br>
            <br>
            Наиболее часто используемые тупые углы: <br>
            <br>
            sin120°=sin(180°−60°)=sin60°=3√2;<br>
            sin150°=sin(180°−30°)=sin30°=12;<br>
            sin135°=sin(180°−45°)=sin45°=2√2. <br>
            <br>
        </div>
        <div class="gxst-title">Радиус описанной окружности</div>
        <div align="left"><img class="gxs-resource-image" alt="Треуг2.jpg" src="//ykl-res.azureedge.net/3292f02a-8c23-4478-9afd-ad573a7c8b47/%D0%A2%D1%80%D0%B5%D1%83%D0%B32.jpg"></div>
        <br>
        <div>
            a / sinA=b / sinB=c / sinC=2R , где  R  — радиус описанной окружности. <br>
            <br>
            Выразив радиус, получаем  R=a / 2sinA , или  R=b / 2sinB , или  R=c /    2sinC . <br>
            <br>
        </div>
        <div class="gxst-title">Теорема косинусов</div>
        <div>
            Для вычисления элементов прямоугольного треугольника достаточно  2  данных величин (две стороны или сторона и угол).<br>
            Для вычисления элементов произвольного треугольника необходимо хотя бы  3  данных величины. <br>
        </div>
        <div><img class="gxs-resource-image" alt="4cepure.JPG" src="//ykl-res.azureedge.net/6410637d-1743-4cc3-a02d-da4f44eaead6/4cepure.JPG"></div>

        <div class="gxst-theory">
            Теорема косинусов <br>
            <br>
            Квадрат стороны треугольника равен сумме квадратов двух других сторон минус удвоенное произведение этих сторон на косинус угла между ними:
            <br>
            <br>
            a2=b2+c2−2⋅b⋅c⋅cosA . <br>
        </div>
        <div>
            Также теорема исполняется для любой стороны треугольника: <br>
            <br>
            b2=a2+c2−2⋅a⋅c⋅cosB ; <br>

            c2=a2+b2−2⋅a⋅b⋅cosC . <br>
            <br>
            Теорема косинусов используется для вычисления: <br>
            неизвестной стороны треугольника, если даны две стороны и угол между ними; <br>
            вычисления косинуса неизвестного угла треугольника, если даны все стороны треугольника. <br>
            Значение косинуса тупого угла находится по формуле приведения  cos(180°−α)=−cosα . <br>
            <br>
            Наиболее часто используемые тупые углы: <br>
            <br>
            cos120°=cos(180°−60°)=−cos60°=−1 / 2; <br>
            cos150°=cos(180°−30°)=−cos30°=−3 / √2; <br>
            cos135°=cos(180°−45°)=−cos45°=−2 / √2. <br>
            <br>
            <br>
            Если необходимо найти приблизительное значение синуса или косинуса другого угла или вычислить угол по найденному синусу или косинусу, то используется таблица или калькулятор. <br>
        </div>
    </div>
</template>

<script>
    export default {
        name: "RelationsBetween"
    }
</script>

<style scoped>

</style>
